/*=========================================================================================
    File Name: smooth-line.js
    Description: Morris line chart
    ----------------------------------------------------------------------------------------
    Item Name: Robust - Responsive Admin Template
    Version: 2.0
    Author: PIXINVENT
    Author URL: http://www.themeforest.net/user/pixinvent
==========================================================================================*/

// Line chart
// ------------------------------
$(window).on("load", function(){

    Morris.Line({
        element: 'smooth-line-chart',
        data: [{
            "year": "2017-08",
            "신속도": 100,
            "친절도": 40,
            "전문성": 62,
            "공정성": 100,
            "신뢰도": 40,
            "만족도": 62
        }, {
            "year": "2017-09",
            "신속도": 66,
            "친절도": 42,
            "전문성": 27,
            "공정성": 35,
            "신뢰도": 70,
            "만족도": 80
        }, {
            "year": "2017-10",
            "신속도": 40,
            "친절도": 88,
            "전문성": 70,
            "공정성": 100,
            "신뢰도": 40,
            "만족도": 62
        }, {
            "year": "2017-11",
            "신속도": 25,
            "친절도": 66,
            "전문성": 75,
            "공정성": 100,
            "신뢰도": 40,
            "만족도": 62
        }, {
            "year": "2017-12",
            "신속도": 100,
            "친절도": 55,
            "전문성": 75,
            "공정성": 88,
            "신뢰도": 70,
            "만족도": 80
        }, {
            "year": "2018-01",
            "신속도": 20,
            "친절도": 32,
            "전문성": 80,
            "공정성": 100,
            "신뢰도": 40,
            "만족도": 62
        }, {
            "year": "2018-02",
            "신속도": 45,
            "친절도": 95,
            "전문성": 45,
            "공정성": 65,
            "신뢰도": 70,
            "만족도": 80
        }, {
            "year": "2018-03",
            "신속도": 97,
            "친절도": 67,
            "전문성": 90,
            "공정성": 100,
            "신뢰도": 40,
            "만족도": 62
        }, {
            "year": "2018-04",
            "신속도": 50,
            "친절도": 70,
            "전문성": 60,
            "공정성": 95,
            "신뢰도": 70,
            "만족도": 80
        }, {
            "year": "2018-05",
            "신속도": 60,
            "친절도": 30,
            "전문성": 90,
            "공정성": 100,
            "신뢰도": 40,
            "만족도": 62
        }, {
            "year": "2018-06",
            "신속도": 10,
            "친절도": 100,
            "전문성": 20,
            "공정성": 75,
            "신뢰도": 70,
            "만족도": 80
        }, {
            "year": "2018-07",
            "신속도": 60,
            "친절도": 42,
            "전문성": 90,
            "공정성": 100,
            "신뢰도": 40,
            "만족도": 62
        }],
        xkey: 'year',
        ykeys: ['신속도', '친절도', '전문성', '공정성', '신뢰도', '만족도'],
        labels: ['신속도', '친절도', '전문성', '공정성', '신뢰도', '만족도'],
        resize: true,
        smooth: true,
        pointSize: 3,
        pointStrokeColors:['#3BAFDA', '#00A5A8', '#AB47BC', '#F6BB42','#DA4453', '#9E9D24'],
        gridLineColor: '#e3e3e3',
        behaveLikeLine: true,
        numLines: 6,
        gridtextSize: 14,
        lineWidth: 1,
        hideHover: 'auto',
        lineColors: ['#3BAFDA', '#00A5A8', '#AB47BC', '#F6BB42','#DA4453', '#9E9D24']
    });
});